In [1]:
import pandas as pd

# Основные структуры данных

In [7]:
data = ['Text', 20, 30, 40, 50]

In [8]:
data

['Text', 20, 30, 40, 50]

In [9]:
# Series 
# Одномерные данные

my_series = pd.Series(data)

In [10]:
my_series

0    Text
1      20
2      30
3      40
4      50
dtype: object

In [49]:
data_df = {
    'Name': ['Alice', 'Rimma'],
    'Age': [21, 24],
    'Describe': ['', 'Yep']
}

In [50]:
# DataFrame
# Двумерные данные

my_df = pd.DataFrame(data_df, index = ['a','b'])

In [51]:
my_df

    Name  Age Describe
0  Alice   21
1  Rimma   24      Yep

In [52]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      2 non-null      object
 1   Age       2 non-null      int64
 2   Describe  2 non-null      object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes

## DataFrame в другие источники

In [53]:
# CSV

In [54]:
# to_csv
my_df.to_csv('1.csv', index = False)

In [55]:
# Excel

!pip install openpyxl

In [56]:
# to_excel
my_df.to_excel('1.xlsx', index = False)

## DataFrame из других источников

In [57]:
# CSV

In [58]:
# read_csv
my_df = pd.read_csv('1.csv')

In [59]:
my_df

    Name  Age Describe
0  Alice   21      NaN
1  Rimma   24      Yep

In [60]:
# Excel

In [91]:
# read_excel
my_df = pd.read_excel('1.xlsx')

In [92]:
my_df

    Name  Age Describe
0  Alice   21      NaN
1  Rimma   24      Yep

# Основные методы DF

head, tail - первые и последние строки в DF

In [63]:
my_df.head(1)

    Name  Age Describe
0  Alice   21      NaN

In [64]:
my_df.tail(1)

    Name  Age Describe
1  Rimma   24      Yep

shape - размер таблицы: первое - количество строк, второе количество - колонок

In [65]:
my_df.shape

(2, 3)

info - базовая информация

In [66]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      2 non-null      object
 1   Age       2 non-null      int64
 2   Describe  1 non-null      object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes

describe - базовая статистика

In [67]:
my_df.describe()

            Age
count   2.00000
mean   22.50000
std     2.12132
min    21.00000
25%    21.75000
50%    22.50000
75%    23.25000
max    24.00000

# Индексация

In [78]:
data_df = {
    'Name': ['Alice', 'Rimma'],
    'Age': [21, 24],
    'Describe': ['', 'Yep']
}

In [79]:
my_df = pd.DataFrame(data_df, index = ['a','b'])

## По столбцам

In [81]:
my_df

    Name  Age Describe
a  Alice   21
b  Rimma   24      Yep

In [82]:
my_df['Name']

a    Alice
b    Rimma
Name: Name, dtype: object

In [83]:
my_df['Age']

a    21
b    24
Name: Age, dtype: int64

In [84]:
my_df[my_df['Age'] > 22]

    Name  Age Describe
b  Rimma   24      Yep

## По строкам

In [85]:
my_df

    Name  Age Describe
a  Alice   21
b  Rimma   24      Yep

loc - выбор по имени индекса

In [87]:
my_df.loc['b']

Name        Rimma
Age            24
Describe      Yep
Name: b, dtype: object

iloc - выбор по номеру строки

In [88]:
my_df.iloc[1]

Name        Rimma
Age            24
Describe      Yep
Name: b, dtype: object

# Работа с пропусками

## Пойск пропусков

In [93]:
my_df

    Name  Age Describe
0  Alice   21      NaN
1  Rimma   24      Yep

isna - находит пропуски

In [94]:
my_df['Describe'].isna()

0     True
1    False
Name: Describe, dtype: bool

In [96]:
my_df[my_df['Describe'].isna()]

    Name  Age Describe
0  Alice   21      NaN

notna - находит те где нет пропусков

In [95]:
my_df['Describe'].notna()

0    False
1     True
Name: Describe, dtype: bool

In [97]:
my_df[my_df['Describe'].notna()]

    Name  Age Describe
1  Rimma   24      Yep

## Удаление и заполнение пропусков

fillna - заполняет пустую ячейку

In [102]:
my_df_fillna = my_df.fillna('Nope')

In [103]:
my_df_fillna

    Name  Age Describe
0  Alice   21     Nope
1  Rimma   24      Yep

dropna - удаляет пустую строку

In [108]:
my_df_dropna = my_df.dropna()

In [109]:
my_df_dropna

    Name  Age Describe
1  Rimma   24      Yep

# Группировки

groupby - групирует данные по стобцам

In [114]:
my_df.groupby('Name')['Age'].value_counts()

Name   Age
Alice  21     1
Rimma  24     1
Name: count, dtype: int64

# Агрегация

In [117]:
my_df['Age'].median()

np.float64(22.5)

mean - среднее

max - максимальное

min - минимальное

sum - сумма

median - медиана

# Сортировка данных

sort_values - сортирует данные

In [121]:
my_df.sort_values(by=['Age', 'Name'], ascending=False)

    Name  Age Describe
1  Rimma   24      Yep
0  Alice   21      NaN

# Объединие

In [123]:
my_df

    Name  Age Describe
0  Alice   21      NaN
1  Rimma   24      Yep

In [129]:
data_df_1 = {
    'FIO': ['Alice', 'Rimma'],
    'Salary': [0, 2400000]
}

In [130]:
my_df_1 = pd.DataFrame(data_df_1)

merge - Объединяет два Df по ключу

In [132]:
merged = pd.merge(my_df, my_df_1, left_on='Name', right_on='FIO')

In [133]:
merged

    Name  Age Describe    FIO   Salary
0  Alice   21      NaN  Alice        0
1  Rimma   24      Yep  Rimma  2400000

concat - соединяет df по строкам

In [134]:
concated = pd.concat([my_df, my_df_1])

In [135]:
concated

    Name   Age Describe    FIO     Salary
0  Alice  21.0      NaN    NaN        NaN
1  Rimma  24.0      Yep    NaN        NaN
0    NaN   NaN      NaN  Alice        0.0
1    NaN   NaN      NaN  Rimma  2400000.0